In [1]:
from numpy.random import randn as rn

In [2]:
import numpy as np
np.random.seed(100)
r=rn(5,4)

In [3]:
r

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [4]:
import pandas as pd

In [7]:
pd.DataFrame(r)

          0         1         2         3
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [8]:
rows=['a','b','c','d','e']
col=['x','y','z','w']

In [9]:
df=pd.DataFrame(r,index=rows,columns=col)

In [10]:
df

          x         y         z         w
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

In [11]:
df.reset_index()

  index         x         y         z         w
0     a -1.749765  0.342680  1.153036 -0.252436
1     b  0.981321  0.514219  0.221180 -1.070043
2     c -0.189496  0.255001 -0.458027  0.435163
3     d -0.583595  0.816847  0.672721 -0.104411
4     e -0.531280  1.029733 -0.438136 -1.118318

In [13]:
df.reset_index(drop=True,inplace=True)

In [14]:
df

          x         y         z         w
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [16]:
df.set_index('z',inplace=True)

In [17]:
df

                  x         y         w
z
 1.153036 -1.749765  0.342680 -0.252436
 0.221180  0.981321  0.514219 -1.070043
-0.458027 -0.189496  0.255001  0.435163
 0.672721 -0.583595  0.816847 -0.104411
-0.438136 -0.531280  1.029733 -1.118318

In [19]:
df.index

Float64Index([   1.153035802563644,  0.22117966922140045,  -0.4580269855026243,
                 0.672720805709661, -0.43813562270441736],
             dtype='float64', name='z')

In [20]:
df.loc[1.153035802563644]

x   -1.749765
y    0.342680
w   -0.252436
Name: 1.153035802563644, dtype: float64

In [21]:
str1="i am lokesh of Amaravathi"

In [22]:
df['new']=str1.split()

In [23]:
df

                  x         y         w         new
z
 1.153036 -1.749765  0.342680 -0.252436           i
 0.221180  0.981321  0.514219 -1.070043          am
-0.458027 -0.189496  0.255001  0.435163      lokesh
 0.672721 -0.583595  0.816847 -0.104411          of
-0.438136 -0.531280  1.029733 -1.118318  Amaravathi

In [26]:
df.set_index('new',inplace=True)

In [27]:
df.loc[['i','lokesh']]

               x         y         w
new
i      -1.749765  0.342680 -0.252436
lokesh -0.189496  0.255001  0.435163

In [28]:
df1=pd.DataFrame({'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[np.nan,5,np.nan]})

In [29]:
df1

     a    b    c
0  1.0  5.0  NaN
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [35]:
df1.dropna(axis=0,thresh=2)###thresh means atleast two nan values

     a    b    c
0  1.0  5.0  NaN
1  2.0  NaN  5.0

In [38]:
df1.dropna(axis=1,thresh=2)

     a
0  1.0
1  2.0
2  NaN

In [42]:
df1.fillna(df1[].mean())

     a    b    c
0  1.0  5.0  1.5
1  2.0  1.5  5.0
2  1.5  1.5  1.5

In [41]:
df1

     a    b    c
0  1.0  5.0  NaN
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [45]:
d={'name':['sudh','sudh','kumar','kumar','xyz','xyz','xyz'],
   'income':[100,400,200,400,170,457,465],
    'com':['ineuron','ineuron','DL','wp','vz','UL','MS']}

In [46]:
d

{'name': ['sudh', 'sudh', 'kumar', 'kumar', 'xyz', 'xyz', 'xyz'],
 'income': [100, 400, 200, 400, 170, 457, 465],
 'com': ['ineuron', 'ineuron', 'DL', 'wp', 'vz', 'UL', 'MS']}

In [48]:

df2=pd.DataFrame(d)

In [49]:
df2

    name  income      com
0   sudh     100  ineuron
1   sudh     400  ineuron
2  kumar     200       DL
3  kumar     400       wp
4    xyz     170       vz
5    xyz     457       UL
6    xyz     465       MS

In [51]:
df2.groupby('name').mean()

       income
name
kumar     300
sudh      250
xyz       364

In [52]:
df2.groupby('name').sum()

       income
name
kumar     600
sudh      500
xyz      1092

In [53]:
df2.describe()

           income
count    7.000000
mean   313.142857
std    151.418216
min    100.000000
25%    185.000000
50%    400.000000
75%    428.500000
max    465.000000

In [57]:
df3=df2.groupby('name').describe()

###

In [56]:
df3

      income
       count   mean         std    min    25%    50%    75%    max
name
kumar    2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0
sudh     2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
xyz      3.0  364.0  168.056538  170.0  313.5  457.0  461.0  465.0

In [61]:
df3['income']['count']

name
kumar    2.0
sudh     2.0
xyz      3.0
Name: count, dtype: float64

In [63]:
df4=df3.loc['sudh']

####

df4

In [64]:
df4

income  count      2.000000
        mean     250.000000
        std      212.132034
        min      100.000000
        25%      175.000000
        50%      250.000000
        75%      325.000000
        max      400.000000
Name: sudh, dtype: float64

####

In [65]:
df4.loc['income'].loc['mean']

250.0

In [69]:
df5=pd.DataFrame(df2.groupby('name').describe().loc['sudh']).transpose()

#####

In [70]:
df5

     income
      count   mean         std    min    25%    50%    75%    max
sudh    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0